Revit 2024 API
OverrideGraphicSettings Class
 Settings to override display of elements in a view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public class OverrideGraphicSettings : IDisposable
Visual Basic
Public Class OverrideGraphicSettings _
	Implements IDisposable
Visual C++
public ref class OverrideGraphicSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.OverrideGraphicSettings
See Also
OverrideGraphicSettings Members
Autodesk.Revit.DB Namespace